tests/perf_test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 10
      arrivalRate: 5  # 5 requests per second for 10 seconds
  thresholds:
    - "http.success_rate > 1"          # no system can have >100% success → guaranteed fail
    - "http.response_time.mean < 0.0001"  # mean response < 0.0001ms → impossible
    - "http.response_time.p95 < 0.0001"   # 95th percentile < 0.0001ms → impossible
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: Employee endpoint test
    flow:
      - get:
          url: "/employee"

  - name: Department endpoint test
    flow:
      - get:
          url: "/department"