tests/perf_test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 1
      arrivalRate: 5  # 5 requests per second for 10 seconds
  thresholds:
    - "http.response_time.p95 < 0.0001"     # 95th percentile < 200 ms
    - "http.response_time.mean < 100"    # mean response < 100 ms
    - "http.success_rate > 0.99"          # 99% of requests must succeed
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: Employee endpoint test
    flow:
      - get:
          url: "/employee"

  - name: Department endpoint test
    flow:
      - get:
          url: "/department"