tests/perf_test.yml
config:
  target: "http://127.0.0.1:5000"
  phases:
    - duration: 10
      arrivalRate: 5

  ensure:
    thresholds:
      - http.success_rate: "> 99"
      - http.response_time.mean: "< 0.0001"
      - http.response_time.p95: "< 0.0001"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: Employee endpoint test
    flow:
      - get:
          url: "/employee"

  - name: Department endpoint test
    flow:
      - get:
          url: "/department"